
# tap repositories and their packages

tap 'homebrew/core'
brew 'aichat' # All-in-one AI-Powered CLI Chat & Copilot
brew 'astroterm' # Planetarium for your terminal
brew 'babelfish' # Translate bash scripts to fish
brew 'bacon' # Background rust code check
brew 'bat' # Clone of cat(1) with syntax highlighting and Git integration
brew 'bear' # Generate compilation database for clang tooling
brew 'bfs' # Breadth-first version of find
brew 'brightness' # Change macOS display brightness from the command-line
brew 'broot' # New way to see and navigate directory trees
brew 'btop' # Resource monitor. C++ version and continuation of bashtop and bpytop
brew 'cargo-llvm-cov' # Cargo subcommand to easily use LLVM source-based code coverage
brew 'cargo-update' # Cargo subcommand for checking and applying updates to installed executables
brew 'choose-rust' # Human-friendly and fast alternative to cut and (sometimes) awk
brew 'clang-format' # Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew 'cmake' # Cross-platform make
brew 'colima' # Container runtimes on MacOS (and Linux) with minimal setup
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'cowsay' # Apjanke's fork of the classic cowsay project
brew 'csvkit' # Suite of command-line tools for converting to and working with CSV
brew 'csvlens' # Command-line csv viewer
brew 'dasel' # JSON, YAML, TOML, XML, and CSV query and modification tool
brew 'datasette' # Open source multi-tool for exploring and publishing data
brew 'docker' # Pack, ship and run any application as a lightweight container
brew 'doggo' # Command-line DNS Client for Humans
brew 'duf' # Disk Usage/Free Utility - a better 'df' alternative
brew 'dust' # More intuitive version of du in rust
brew 'duti' # Select default apps for documents and URL schemes on macOS
brew 'dwdiff' # Diff that operates at the word level
brew 'dysk' # Linux utility to get information on filesystems, like df but better
brew 'enchant' # Spellchecker wrapping library
brew 'entr' # Run arbitrary commands when files change
brew 'eza' # Modern, maintained replacement for ls
brew 'fd' # Simple, fast and user-friendly alternative to find
brew 'fish' # User-friendly command-line shell for UNIX-like operating systems
brew 'fish-lsp' # LSP implementation for the fish shell language
brew 'fisher' # Plugin manager for the Fish shell
brew 'fsevents-tools' # Command-line utilities for the FSEvents API
brew 'fswatch' # Monitor a directory for changes and run a shell command
brew 'fzf' # Command-line fuzzy finder written in Go
brew 'gcc' # GNU compiler collection
brew 'gemini-cli' # Interact with Google Gemini AI models from the command-line
brew 'gh' # GitHub command-line tool
brew 'git' # Distributed revision control system
brew 'git-delta' # Syntax-highlighting pager for git and diff output
brew 'glow' # Render markdown on the CLI
brew 'gnu-sed' # GNU implementation of the famous stream editor
brew 'htop' # Improved top (interactive process viewer)
brew 'hyperfine' # Command-line benchmarking tool
brew 'imagemagick' # Tools and libraries to manipulate images in select formats
brew 'jj' # Git-compatible distributed version control system
brew 'jjui' # TUI for interacting with the Jujutsu version control system
brew 'jsongrep' # Query tool for JSON, YAML, TOML, and other structured formats
brew 'just' # Handy way to save and run project-specific commands
brew 'libtool' # Generic library support script
brew 'llm' # Access large language models from the command-line
brew 'lnav' # Curses-based tool for viewing and analyzing log files
brew 'lua-language-server' # Language Server for the Lua language
brew 'make' # Utility for directing compilation
brew 'man-db' # Unix documentation system
brew 'markdown' # Text-to-HTML conversion tool
brew 'mas' # Mac App Store command-line interface
brew 'media-info' # Unified display of technical and tag data for audio/video
brew 'mpv' # Media player based on MPlayer and mplayer2
brew 'ncurses' # Text-based UI library
brew 'ninja' # Small build system for use with gyp or CMake
brew 'notmuch' # Thread-based email index, search, and tagging
brew 'pipx' # Execute binaries from Python packages in isolated environments
brew 'pkgconf' # Package compiler and linker metadata toolkit
brew 'pnpm' # Fast, disk space efficient package manager
brew 'prek' # Pre-commit re-implemented in Rust
brew 'prettier' # Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew 'procs' # Modern replacement for ps written in Rust
brew 'python-lsp-server' # Python Language Server for the Language Server Protocol
brew 'qemu' # Generic machine emulator and virtualizer
brew 'qsv' # Ultra-fast CSV data-wrangling toolkit
brew 'ripgrep' # Search tool like grep and The Silver Searcher
brew 'rsyncy' # Status/progress bar for rsync
brew 'ruff' # Extremely fast Python linter, written in Rust
brew 'rustup' # Rust toolchain installer
brew 'sd' # Intuitive find & replace CLI
brew 'sdl3' # Low-level access to audio, keyboard, mouse, joystick, and graphics
brew 'speedtest-cli' # Command-line interface for https://speedtest.net bandwidth tests
brew 'starship' # Cross-shell prompt for astronauts
brew 'swiftly' # Swift toolchain installer and manager
brew 'timg' # Terminal image and video viewer
brew 'tlrc' # Official tldr client written in Rust
brew 'tmux' # Terminal multiplexer
brew 'tokei' # Program that allows you to count code, quickly
brew 'topgrade' # Upgrade all the things
brew 'transmission-cli' # Lightweight BitTorrent client
brew 'ty' # Extremely fast Python type checker, written in Rust
brew 'typescript-language-server' # Language Server Protocol implementation for TypeScript wrapping tsserver
brew 'uv' # Extremely fast Python package installer and resolver, written in Rust
brew 'viddy' # Modern watch command
brew 'watch' # Executes a program periodically, showing output fullscreen
brew 'watchexec' # Execute commands when watched files change
brew 'xdg-ninja', args: ['HEAD'] # Check your $HOME for unwanted files and directories
brew 'yazi' # Blazing fast terminal file manager written in Rust, based on async I/O
brew 'yq' # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew 'yt-dlp' # Feature-rich command-line audio/video downloader
brew 'zellij' # Pluggable terminal workspace, with terminal multiplexer as the base feature
brew 'zig' # Programming language designed for robustness, optimality, and clarity
brew 'zls' # Language Server for Zig
brew 'zoxide' # Shell extension to navigate your filesystem faster

tap 'homebrew/cask'
cask '1password' # Password manager that keeps all passwords secure behind one password
cask 'activitywatch' # Time tracker
cask 'alt-tab' # Enable Windows-like alt-tab
cask 'android-studio' # Tools for building Android applications
cask 'antigravity' # AI Coding Agent IDE
cask 'bartender' # Menu bar icon organiser
cask 'chatgpt' # OpenAI's official ChatGPT desktop app
cask 'claude' # Anthropic's official Claude AI desktop app
cask 'claude-code@latest' # Terminal-based AI coding assistant
cask 'codex' # OpenAI's coding agent that runs in your terminal
cask 'codexbar' # Menu bar usage monitor for Codex and Claude
cask 'copilot-cli' # Brings the power of Copilot coding agent directly to your terminal
cask 'darktable' # Photography workflow application and raw developer
cask 'discord' # Voice and text chat software
cask 'electron-cash' # Thin client for Bitcoin Cash
cask 'element' # Matrix collaboration client
cask 'firefox' # Web browser
cask 'font-iosevka' #
cask 'font-maple-mono' #
cask 'fork' # GIT client
cask 'ghostty@tip' # Terminal emulator that uses platform-native UI and GPU acceleration
cask 'google-chrome' # Web browser
cask 'google-drive' # Client for the Google Drive storage service
cask 'iina' # Free and open-source media player
cask 'istat-menus' # System monitoring app
cask 'kitty' # GPU-based terminal emulator
cask 'llamabarn' # Menu bar app for running local LLMs
cask 'mediainfo' # Display technical and tag data for video and audio files
cask 'mullvad-vpn' # VPN client
cask 'netnewswire' # Free and open-source RSS reader
cask 'onedrive' # Cloud storage client
cask 'opencode-desktop' # AI coding agent desktop client
cask 'openmtp' # Android file transfer
cask 'pcsx2' # Playstation 2 Emulator
cask 'qbittorrent' # Peer to peer Bitorrent client
cask 'rectangle-pro' # Window snapping tool
cask 'scroll-reverser' # Tool to reverse the direction of scrolling
cask 'signal' # Instant messaging application focusing on security
cask 'steam' # Video game digital distribution service
cask 'thorium' # Epub reader
cask 'transmission' # Open-source BitTorrent client
cask 'visual-studio-code' # Open-source code editor
cask 'vlc' # Multimedia player
cask 'wispr-flow' # Voice-to-text dictation with AI-powered auto-editing
cask 'zed' # Multiplayer code editor

tap 'anomalyco/tap'
brew 'opencode' # The AI coding agent built for the terminal.

tap 'borkdude/brew'
brew 'babashka' # Native, fast starting Clojure interpreter for scripting.

tap 'cirruslabs/cli'
brew 'tart' # Run macOS and Linux VMs on Apple Hardware

tap 'd12frosted/emacs-plus'
cask 'emacs-plus-app' # GNU Emacs text editor with patches for macOS

tap 'dmmulroy/tap'
brew 'jj-starship' # Unified Starship prompt module for Git and Jujutsu repositories

tap 'felixkratz/formulae'

tap 'guilhermeprokisch/see'

tap 'jackielii/tap'
brew 'skhd-zig' # Simple hotkey daemon for macOS, written in Zig

tap 'jimeh/emacs-builds'

tap 'jpe90/clp'
brew 'clp' # command line syntax highlighter

tap 'koekeishiya/formulae'

tap 'nikitabobko/tap'
cask 'aerospace' # AeroSpace is an i3-like tiling window manager for macOS

tap 'oven-sh/bun'
brew 'bun' # Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.

tap 'ramonvermeulen/whosthere'
cask 'whosthere' # Local network discovery tool with an interactive Terminal User Interface (TUI) written in Go.

tap 'rcmdnk/file'
brew 'brew-file' # Brewfile manager for Homebrew.

tap 'rcmdnk/rcmdnkpac'

tap 'riscv/riscv'
brew 'riscv-tools' # RISC-V toolchain including gcc (with newlib), simulator (spike), and pk

tap 'steipete/tap'
brew 'gogcli' # Google CLI for Gmail, Calendar, Drive, Docs, Sheets, and more

tap 'terror/tap'
brew 'just-lsp' # Language server for just

tap 'tsonglew/dutis'
brew 'dutis' # A cmd util to manage default app on macOS, inspired by duti

# App Store applications
mas '1Password for Safari (8.12.8)', id: 1569813296
mas 'Amazon Kindle (7.55)', id: 302584613
mas 'Amphetamine (5.3.2)', id: 937984704
mas 'CrystalFetch (2.2.0)', id: 6454431289
mas 'DaisyDisk (4.33.3)', id: 411643860
mas 'Final Cut Pro (12.0)', id: 424389933
mas 'GarageBand (10.4.13)', id: 682658836
mas 'iMovie (10.4.4)', id: 408981434
mas 'Keynote (14.5)', id: 409183694
mas 'Maccy (2.6.1)', id: 1527619437
mas 'Numbers (14.5)', id: 409203825
mas 'Pages (14.5)', id: 409201541
mas 'Pixea (8.0.1)', id: 1507782672
mas 'Quiche Reader (1.8)', id: 1387881185
mas 'Scrobbles for Last.fm (9.4.1)', id: 1344679160
mas 'Tim (9.8.2)', id: 1449619230
mas 'Time Out (2.9.7)', id: 402592703
mas 'UTM (4.7.5)', id: 1538878817
mas 'WhatsApp (26.11.74)', id: 310633997
mas 'Xcode (26.4)', id: 497799835
mas 'YamaCast (2.0.7)', id: 1415107621
