;;; packages.el -*- lexical-binding: t; -*-
(unpin!
 counsel
 doom-modeline
 flycheck
 git-commit
 ivy
 magit
 notmuch
 swiper
 with-editor)

(package! solarized-theme)
(package! buffer-move)
(package! zoom-window)
(package! string-inflection)
(package! dired-hide-dotfiles)
(package! pkgbuild-mode)
(package! highlight-thing)
(package! defrepeater)
(package! keychain-environment)
(package! ztree)
(package! visual-fill-column)
(package! password-store)
(package! outshine)
(package! ivy-xref)
(package! eglot   :disable WORK)
(package! project :disable WORK)
(package! logview)
(package! journalctl-mode)
(package! systemd)
(package! emacs-w3m)
(package! haskell-mode)
(package! ssh-config-mode)
(package! lua-mode)
(package! edit-server)
(package! tree-sitter)
(package! tree-sitter-langs)
(package! meson-mode)
(package! php-mode)
(package! dired-hide-dotfiles)
(package! ripgrep)
(package! sql-indent)
