;;; packages.el -*- lexical-binding: t; -*-
(package! solarized-theme)
(package! buffer-move)
(package! zoom-window)
(package! string-inflection)
(package! dired-hide-dotfiles)
(package! pkgbuild-mode)
(package! highlight-thing)
(package! defrepeater)
(package! keychain-environment)
(package! ztree)
(package! visual-fill-column)
(package! password-store)
(package! outshine)
(package! ivy-xref)
(package! eglot   :disable WORK)
(package! project :disable WORK)
(package! logview)
(package! journalctl-mode)
(package! systemd)
