tap "borkdude/brew"
tap "cirruslabs/cli"
tap "d12frosted/emacs-plus"
tap "dmmulroy/tap"
tap "felixkratz/formulae"
tap "jackielii/tap"
tap "jimeh/emacs-builds"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "riscv/riscv"
# Planetarium for your terminal
brew "astroterm"
# Background rust code check
brew "bacon"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generate compilation database for clang tooling
brew "bear"
# Breadth-first version of find
brew "bfs"
# Change macOS display brightness from the command-line
brew "brightness"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# CLI tool to convert your codebase into a single LLM prompt
brew "code2prompt"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line csv viewer
brew "csvlens"
# Command-line DNS Client for Humans
brew "doggo"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Linux utility to get information on filesystems, like df but better
brew "dysk"
# Spellchecker wrapping library
brew "enchant"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Generic library support script
brew "libtool"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Git-compatible distributed version control system
brew "jj"
# TUI for interacting with the Jujutsu version control system
brew "jjui"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Language Server for the Lua language
brew "lua-language-server"
# Utility for directing compilation
brew "make"
# Unix documentation system
brew "man-db"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Small build system for use with gyp or CMake
brew "ninja"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Status/progress bar for rsync
brew "rsyncy"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Rust toolchain installer
brew "rustup"
# Intuitive find & replace CLI
brew "sd"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl3"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Swift toolchain installer and manager
brew "swiftly"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal image and video viewer
brew "timg"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Lightweight BitTorrent client
brew "transmission-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Modern watch command
brew "viddy"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# CSV CLI magician written in Rust
brew "xan"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja", args: ["HEAD"]
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Native, fast starting Clojure interpreter for scripting.
brew "borkdude/brew/babashka"
# Run macOS and Linux VMs on Apple Hardware
brew "cirruslabs/cli/tart"
# Unified Starship prompt module for Git and Jujutsu repositories
brew "dmmulroy/tap/jj-starship"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Simple hotkey daemon for macOS, written in Zig
brew "jackielii/tap/skhd-zig"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# RISC-V toolchain including gcc (with newlib), simulator (spike), and pk
brew "riscv/riscv/riscv-tools"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Time tracker
cask "activitywatch"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# AI Coding Agent IDE
cask "antigravity"
# File manager
cask "bloom"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Photography workflow application and raw developer
cask "darktable"
# Voice and text chat software
cask "discord"
# GNU Emacs text editor
cask "emacs-app"
# Web browser
cask "firefox"
cask "font-iosevka"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# System monitoring app
cask "istat-menus"
# Menu bar manager
cask "jordanbaird-ice"
# GPU-based terminal emulator
cask "kitty"
# Menu bar app for running local LLMs
cask "llamabarn"
# Adaptive brightness for external displays
cask "lunar"
# Display technical and tag data for video and audio files
cask "mediainfo"
# VPN client
cask "mullvad-vpn"
# Cloud storage client
cask "onedrive"
# Android file transfer
cask "openmtp"
# Playstation 2 Emulator
cask "pcsx2"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Window snapping tool
cask "rectangle-pro"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Instant messaging application focusing on security
cask "signal"
# Video game digital distribution service
cask "steam"
# Mux and tag mp4 files
cask "subler"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "CrystalFetch", id: 6454431289
mas "DaisyDisk", id: 411643860
mas "Enchanted", id: 6474268307
mas "GarageBand", id: 682658836
mas "Hyperfocus", id: 1621523525
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Maccy", id: 1527619437
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Scrobbles for Last.fm", id: 1344679160
mas "Tim", id: 1449619230
mas "Time Out", id: 402592703
mas "UTM", id: 1538878817
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
mas "YamaCast", id: 1415107621
vscode "13xforever.language-x86-64-assembly"
vscode "activitywatch.aw-watcher-vscode"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "basdp.language-gas-x86"
vscode "bbenoist.nix"
vscode "bierner.lit-html"
vscode "bluebrown.yamlfmt"
vscode "boyswan.glsl-literal"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "colton.inline-html"
vscode "dandric.vscode-jq"
vscode "dart-code.dart-code"
vscode "denoland.vscode-deno"
vscode "devkir.elixir-syntax-vscode"
vscode "dmitry-korobchenko.prototxt"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dtsvet.vscode-wasm"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "formulahendry.code-runner"
vscode "fredrikbakke.agda-syntax"
vscode "geforcelegend.vscode-glsl"
vscode "gimly81.fortran"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "guyskk.language-cython"
vscode "harryhopkinson.vs-code-runner"
vscode "humao.rest-client"
vscode "idleberg.applescript"
vscode "jakebathman.mysql-syntax"
vscode "jasonnutter.vscode-codeowners"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-c-syntax"
vscode "jeff-hykin.better-csv-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-go-syntax"
vscode "jeff-hykin.better-js-syntax"
vscode "jeff-hykin.better-lisp-syntax"
vscode "jeff-hykin.better-objc-syntax"
vscode "jeff-hykin.better-perl-syntax"
vscode "jeff-hykin.better-prolog-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeff-hykin.better-syntax"
vscode "jep-a.lua-plus"
vscode "jonwolfe.language-polymer"
vscode "jscearcy.rust-doc-viewer"
vscode "justjavac.vscode-deno-extensionpack"
vscode "justusadam.language-haskell"
vscode "karunamurti.haml"
vscode "kennethceyer.io"
vscode "kevinrose.vsc-python-indent"
vscode "laurencebahiirwa.deno-std-lib-snippets"
vscode "ldez.ignore-files"
vscode "liviuschera.noctis"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lorenzopirro.rust-flash-snippets"
vscode "magicstack.magicpython"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "mrcrowl.hg"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "nyxiative.rust-and-friends"
vscode "orta.vscode-jest"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "pkief.material-icon-theme"
vscode "polymeilex.rust-targets"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "radium-v.better-less"
vscode "rebornix.prolog"
vscode "redcmd.tmlanguage-syntax-highlighter"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "shopify.ruby-lsp"
vscode "sidneys1.gitconfig"
vscode "slevesque.shader"
vscode "stkb.rewrap"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "toasty-technologies.octave"
vscode "tonsky.theme-alabaster"
vscode "tuttieee.emacs-mcx"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "willmtemple.vscode-hyperion"
vscode "yuce.erlang-otp"
vscode "zhangyue.rust-mod-generator"
vscode "zhuangtongfa.material-theme"
