tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "rcmdnk/file"
brew "bat"
brew "black"
brew "btop"
brew "choose-rust"
brew "cmake"
brew "coreutils"
brew "docker", link: false
brew "dust"
brew "eza"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "libtool"
brew "graphviz"
brew "helix"
brew "iproute2mac"
brew "ispell"
brew "lesspipe"
brew "mackup"
brew "man-db"
brew "mas"
brew "media-info"
brew "mercurial"
brew "moreutils"
brew "mosh"
brew "mpv"
brew "nmap"
brew "node"
brew "nushell"
brew "pipx"
brew "procs"
brew "python-lxml"
brew "python-requests"
brew "ripgrep"
brew "ruff"
brew "rust-analyzer"
brew "rustup-init"
brew "speedtest-cli"
brew "stow"
brew "tlrc"
brew "tmux"
brew "topgrade"
brew "watchexec"
brew "yapf"
brew "youtube-dl"
brew "zile"
cask "1password"
cask "bettertouchtool"
cask "bluebubbles"
cask "calibre"
cask "darktable"
cask "discord"
cask "docker"
cask "emacs-mac"
cask "firefox"
cask "fleet"
cask "font-iosevka"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "google-drive-file-stream"
cask "intellij-idea-ce"
cask "iterm2"
cask "krita"
cask "lastfm"
cask "lmms"
cask "logitech-options"
cask "mediainfo"
cask "messenger"
cask "microsoft-auto-update"
cask "mullvadvpn"
cask "rectangle-pro"
cask "ripcord"
cask "signal"
cask "steam"
cask "textmate"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whichspace"
cask "zed"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Adobe Lightroom", id: 1451544217
mas "Affinity Photo 2", id: 1616822987
mas "Amphetamine", id: 937984704
mas "Brother iPrint&Scan", id: 1193539993
mas "Capo", id: 696977615
mas "CrystalFetch", id: 6454431289
mas "DaisyDisk", id: 411643860
mas "Final Cut Pro", id: 424389933
mas "Flighty", id: 1358823008
mas "Focus", id: 777233759
mas "GarageBand", id: 682658836
mas "Habitify", id: 1111447047
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "Maccy", id: 1527619437
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Oldr", id: 1475048161
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Steam Link", id: 1246969117
mas "Structured", id: 1499198946
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Time Out", id: 402592703
mas "UTM", id: 1538878817
mas "Xcode", id: 497799835
mas "YamaCast", id: 1415107621
vscode "13xforever.language-x86-64-assembly"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "basdp.language-gas-x86"
vscode "bbenoist.nix"
vscode "bierner.lit-html"
vscode "boyswan.glsl-literal"
vscode "bungcip.better-toml"
vscode "codezombiech.gitignore"
vscode "colton.inline-html"
vscode "dart-code.dart-code"
vscode "devkir.elixir-syntax-vscode"
vscode "dmitry-korobchenko.prototxt"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dtsvet.vscode-wasm"
vscode "dustypomerleau.rust-syntax"
vscode "equinusocio.vsc-material-theme-icons"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "formulahendry.code-runner"
vscode "geforcelegend.vscode-glsl"
vscode "gimly81.fortran"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "guyskk.language-cython"
vscode "harryhopkinson.vs-code-runner"
vscode "idleberg.applescript"
vscode "jakebathman.mysql-syntax"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-c-syntax"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-go-syntax"
vscode "jeff-hykin.better-js-syntax"
vscode "jeff-hykin.better-objc-syntax"
vscode "jeff-hykin.better-objcpp-syntax"
vscode "jeff-hykin.better-perl-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeff-hykin.better-syntax"
vscode "jep-a.lua-plus"
vscode "jonwolfe.language-polymer"
vscode "jscearcy.rust-doc-viewer"
vscode "justusadam.language-haskell"
vscode "karunamurti.haml"
vscode "kennethceyer.io"
vscode "kevinrose.vsc-python-indent"
vscode "ldez.ignore-files"
vscode "lorenzopirro.rust-flash-snippets"
vscode "magicstack.magicpython"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "mrcrowl.hg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "nyxiative.rust-and-friends"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "pkief.material-icon-theme"
vscode "polymeilex.rust-targets"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "radium-v.better-less"
vscode "rebornix.prolog"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "serayuzgur.crates"
vscode "shopify.ruby-lsp"
vscode "sidneys1.gitconfig"
vscode "slevesque.shader"
vscode "stkb.rewrap"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "toasty-technologies.octave"
vscode "tuttieee.emacs-mcx"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "yuce.erlang-otp"
vscode "zhangyue.rust-mod-generator"
vscode "zhuangtongfa.material-theme"
