tap "chase/tap"
tap "d12frosted/emacs-plus"
tap "da-luce/astroterm"
tap "domt4/autoupdate"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "zkondor/dist"
# Run your GitHub Actions locally
brew "act"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# AI pair programming in your terminal
brew "aider"
# Slice and dice log files on the command-line
brew "angle-grinder"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Translate bash scripts to fish
brew "babelfish"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Breadth-first version of find
brew "bfs"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Watches over your Cargo project's source
brew "cargo-watch"
# Make choices on the command-line
brew "choose"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Command-line csv viewer
brew "csvlens"
# Debugger for the Go programming language
brew "delve"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tool for testing and debugging Dependabot update jobs
brew "dependabot"
# Command-line DNS Client for Humans
brew "doggo"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Spellchecker wrapping library
brew "enchant"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# CLI for making updates across multiple Github repositories with a single command
brew "git-xargs"
# Multi-platform library for OpenGL applications
brew "glfw"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
# Generic library support script
brew "libtool"
# GitHub Markdown previewer
brew "grip"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# International Ispell
brew "ispell"
# Git-compatible distributed version control system
brew "jj"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Package manager for kubectl plugins
brew "krew"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Input filter for the pager less
brew "lesspipe"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Text-to-HTML conversion tool
brew "markdown"
# Unix documentation system
brew "man-db"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Experimental optional static type checker for Python
brew "mypy"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Service monitoring system and time series database
brew "prometheus"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# YAML framework for Python
brew "pyyaml"
# QR Code generation
brew "qrencode"
# Ultra-fast CSV data-wrangling toolkit
brew "qsv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Language Server Protocol implementation for Ruff
brew "ruff-lsp"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Intuitive find & replace CLI
brew "sd"
# Bash syntax highlighter that encourages/fixes variables quoting
brew "shellharden"
# CLI and dbus interface for WhisperSystems/libsignal-service-java
brew "signal-cli"
# Work with remote images registries
brew "skopeo"
# Editor of encrypted files
brew "sops"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# TOML toolkit written in Rust
brew "taplo"
# Terraform Language Server
brew "terraform-ls"
# Terminal image and video viewer
brew "timg"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Upgrade all the things
brew "topgrade"
# Language for application scale JavaScript development
brew "typescript"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Modern watch command
brew "viddy"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja", args: ["HEAD"]
# Fast CSV toolkit written in Rust
brew "xsv"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Text editor development kit
brew "zile"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Tool for writing better scripts
brew "zx"
# Chromium-based browser that renders in Kitty
brew "chase/tap/awrit"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@30"
# Celestial viewer for the terminal, written in C with ncurses
brew "da-luce/astroterm/astroterm"
# Terraform
brew "hashicorp/tap/terraform"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Command-line interface for 1Password
cask "1password-cli"
# Time tracker
cask "activitywatch"
# GPU-accelerated terminal emulator
cask "alacritty"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Mobile gaming platform
cask "bluestacks"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Allows switching between application windows
cask "contexts"
# Photography workflow application and raw developer
cask "darktable"
# Web browser
cask "firefox"
cask "font-iosevka"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# System monitoring app
cask "istat-menus"
# Your internet connection status at a glance
cask "istherenet"
# File archiver
cask "keka"
# GPU-based terminal emulator
cask "kitty"
# Free and open-source painting and sketching program
cask "krita"
# Music services manager
cask "lastfm"
# Support for Logitech G gear
cask "logitech-g-hub"
# Adaptive brightness for external displays
cask "lunar"
# Sandbox construction video game
cask "minecraft"
# Free and open-source RSS reader
cask "netnewswire"
# Open-source software for live streaming and screen recording
cask "obs"
# Get up and running with large language models locally
cask "ollama"
# Open source build of Lens Kubernetes IDE
cask "openlens"
# WebKit based web browser
cask "orion"
# Window snapping tool
cask "rectangle-pro"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Instant messaging application focusing on security
cask "signal"
# Video game digital distribution service
cask "steam"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Multimedia player
cask "vlc"
# Active space menu bar icon
cask "whichspace"
# Multiplayer code editor
cask "zed"
# A tool to toggle Macbook's infamous notch in one click with automation support
cask "znotch"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Boop", id: 1518425043
mas "CotEditor", id: 1024640650
mas "DaisyDisk", id: 411643860
mas "Enchanted", id: 6474268307
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "Hyperspace", id: 6739505345
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Maccy", id: 1527619437
mas "MC Desktop Controller", id: 6448796222
mas "Messenger", id: 1480068668
mas "Mic Drop", id: 1489816366
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "rcmd", id: 1596283165
mas "Slack", id: 803453959
mas "Tim", id: 1449619230
mas "Tot", id: 1491071483
mas "UTM", id: 1538878817
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "YamaCast", id: 1415107621
vscode "13xforever.language-x86-64-assembly"
vscode "activitywatch.aw-watcher-vscode"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "basdp.language-gas-x86"
vscode "bbenoist.nix"
vscode "bierner.lit-html"
vscode "bluebrown.yamlfmt"
vscode "boyswan.glsl-literal"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "colton.inline-html"
vscode "dandric.vscode-jq"
vscode "dart-code.dart-code"
vscode "denoland.vscode-deno"
vscode "devkir.elixir-syntax-vscode"
vscode "dmitry-korobchenko.prototxt"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dtsvet.vscode-wasm"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "fill-labs.dependi"
vscode "formulahendry.code-runner"
vscode "fredrikbakke.agda-syntax"
vscode "geforcelegend.vscode-glsl"
vscode "gimly81.fortran"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "guyskk.language-cython"
vscode "harryhopkinson.vs-code-runner"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "idleberg.applescript"
vscode "jakebathman.mysql-syntax"
vscode "jasonnutter.vscode-codeowners"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-c-syntax"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-csv-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-go-syntax"
vscode "jeff-hykin.better-js-syntax"
vscode "jeff-hykin.better-lisp-syntax"
vscode "jeff-hykin.better-objc-syntax"
vscode "jeff-hykin.better-objcpp-syntax"
vscode "jeff-hykin.better-perl-syntax"
vscode "jeff-hykin.better-prolog-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeff-hykin.better-syntax"
vscode "jep-a.lua-plus"
vscode "jonwolfe.language-polymer"
vscode "jscearcy.rust-doc-viewer"
vscode "justjavac.vscode-deno-extensionpack"
vscode "justusadam.language-haskell"
vscode "karunamurti.haml"
vscode "kennethceyer.io"
vscode "kevinrose.vsc-python-indent"
vscode "laurencebahiirwa.deno-std-lib-snippets"
vscode "ldez.ignore-files"
vscode "liviuschera.noctis"
vscode "lorenzopirro.rust-flash-snippets"
vscode "magicstack.magicpython"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "mrcrowl.hg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "nyxiative.rust-and-friends"
vscode "openai.chatgpt"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "pkief.material-icon-theme"
vscode "polymeilex.rust-targets"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "radium-v.better-less"
vscode "rebornix.prolog"
vscode "redcmd.tmlanguage-syntax-highlighter"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "shopify.ruby-lsp"
vscode "sidneys1.gitconfig"
vscode "slevesque.shader"
vscode "stkb.rewrap"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "toasty-technologies.octave"
vscode "tuttieee.emacs-mcx"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "willmtemple.vscode-hyperion"
vscode "yuce.erlang-otp"
vscode "zhangyue.rust-mod-generator"
vscode "zhuangtongfa.material-theme"
